In [1]:
%matplotlib inline
import requests
import json
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import datetime
from pprint import pprint

In [2]:
df_IR_mortgage_thirty = pd.read_csv('MORTGAGE30US.csv')
df_IR_mortgage_thirty.head()

         DATE  VALUE
0  1971-04-02   7.33
1  1971-04-09   7.31
2  1971-04-16   7.31
3  1971-04-23   7.31
4  1971-04-30   7.29

In [3]:
# Grab only data from 2013 onwards
df_IR_mortgage_thirty = df_IR_mortgage_thirty.truncate(before=2188, after=2478)

# Remove day from data to allow groupby
df_IR_mortgage_thirty['DATE'] = df_IR_mortgage_thirty['DATE'].str[:-3]

In [4]:
# Group by date, this way you can grab the 
# timepoints the group has agreed on

df_mortgage_gb_month = df_IR_mortgage_thirty.groupby(['DATE'])
grouped_mortgage_month = df_mortgage_gb_month.mean()
grouped_mortgage_month.reset_index()

       DATE   VALUE
0   2013-03  3.5650
1   2013-04  3.4450
2   2013-05  3.5360
3   2013-06  4.0700
4   2013-07  4.3700
5   2013-08  4.4560
6   2013-09  4.4900
7   2013-10  4.1920
8   2013-11  4.2550
9   2013-12  4.4575
10  2014-01  4.4320
11  2014-02  4.3025
12  2014-03  4.3425
13  2014-04  4.3375
14  2014-05  4.1920
15  2014-06  4.1625
16  2014-07  4.1300
17  2014-08  4.1150
18  2014-09  4.1625
19  2014-10  4.0360
20  2014-11  3.9975
21  2014-12  3.8640
22  2015-01  3.6700
23  2015-02  3.7100
24  2015-03  3.7700
25  2015-04  3.6720
26  2015-05  3.8400
27  2015-06  3.9825
28  2015-07  4.0460
29  2015-08  3.9050
..      ...     ...
37  2016-04  3.6050
38  2016-05  3.6000
39  2016-06  3.5680
40  2016-07  3.4400
41  2016-08  3.4350
42  2016-09  3.4600
43  2016-10  3.4700
44  2016-11  3.7700
45  2016-12  4.1980
46  2017-01  4.1500
47  2017-02  4.1675
48  2017-03  4.1960
49  2017-04  4.0450
50  2017-05  4.0100
51  2017-06  3.9040
52  2017-07  3.9675
53  2017-08  3.8800
54  2017-09  3.8050
55  2017-10  3.8950
56  2017-11  3.9220
57  2017-12  3.9500
58  2018-01  4.0325
59  2018-02  4.3300
60  2018-03  4.4440
61  2018-04  4.4675
62  2018-05  4.5860
63  2018-06  4.5700
64  2018-07  4.5275
65  2018-08  4.5500
66  2018-09  4.6275

[67 rows x 2 columns]

In [5]:
grouped_mortgage_month = grouped_mortgage_month.iloc[::3,:]
grouped_mortgage_month.reset_index()

       DATE   VALUE
0   2013-03  3.5650
1   2013-06  4.0700
2   2013-09  4.4900
3   2013-12  4.4575
4   2014-03  4.3425
5   2014-06  4.1625
6   2014-09  4.1625
7   2014-12  3.8640
8   2015-03  3.7700
9   2015-06  3.9825
10  2015-09  3.8900
11  2015-12  3.9640
12  2016-03  3.6940
13  2016-06  3.5680
14  2016-09  3.4600
15  2016-12  4.1980
16  2017-03  4.1960
17  2017-06  3.9040
18  2017-09  3.8050
19  2017-12  3.9500
20  2018-03  4.4440
21  2018-06  4.5700
22  2018-09  4.6275

In [6]:
%store -r

# Show the Austin Median Income

In [7]:
df_AustinMedianIncome

       year        income
0   2013-03  61192.850000
1   2013-06  61722.400000
2   2013-09  61574.530000
3   2014-03  62657.830000
4   2014-06  63625.290000
5   2014-09  64792.600000
6   2015-03  66331.920000
7   2015-06  66712.460000
8   2015-09  67443.320000
9   2016-03  69529.540000
10  2016-06  70512.240000
11  2016-09  71526.150000
12  2016-12  72435.070000
13  2017-03  72903.852594
14  2017-06  73372.635187
15  2017-09  73841.417781
16  2017-12  74310.200375
17  2018-03  74778.982969
18  2018-06  75247.765562
19  2018-09  75716.548156

# Show the National Median Income

In [8]:
df_National_Median_Income

       year        income
0   2013-03  52244.570000
1   2013-06  52371.660000
2   2013-09  52055.650000
3   2014-03  52771.680000
4   2014-06  53340.510000
5   2014-09  53983.380000
6   2015-03  55010.420000
7   2015-06  55485.000000
8   2015-09  55977.250000
9   2016-03  57002.410000
10  2016-06  57421.690000
11  2016-09  57814.980000
12  2016-12  58228.920000
13  2017-03  58659.092115
14  2017-06  59089.264229
15  2017-09  59519.436344
16  2017-12  59949.608458
17  2018-03  60379.780573
18  2018-06  60809.952687
19  2018-09  61240.124802

# Transform both dataframes
* Transform the household income dataframes by multiplying the median household income by 0.3, and then dividing by 12.
* This will allow us to compare directly between the median household income and the monthly mortgage payments.
* In THEORY, monthly mortgage payments SHOULD be higher than the transformed median household income, proving that Austin is not affordable

# Show the Austin Household Sale Price

In [9]:
df_Austin_SalePrice

       year  SalePrice
0   2013-03        NaN
1   2013-06        NaN
2   2013-09        NaN
3   2014-03        NaN
4   2014-06   260000.0
5   2014-09   269800.0
6   2015-03   278300.0
7   2015-06   295500.0
8   2015-09   285900.0
9   2016-03   302800.0
10  2016-06   305500.0
11  2016-09   314900.0
12  2016-12   315500.0
13  2017-03   317100.0
14  2017-06   330100.0
15  2017-09   327100.0
16  2017-12   341600.0
17  2018-03   347800.0
18  2018-06   341300.0
19  2018-09   358700.0

# Show the National Household Sale Price

In [10]:
y_aus_notax

2013-03    259592.601432
2013-06    270187.350835
2013-09    278961.575179
2014-03    289120.525060
2014-06    289509.785203
2014-09    294909.785203
2015-03    303280.906921
2015-06    307954.653938
2015-09    310466.109785
2016-03    324712.649165
2016-06    327691.169451
2016-09    332300.477327
2016-12    339491.408115
2017-03    346911.217184
2017-06    351291.646778
2017-09    356605.489260
2017-12    368607.159905
2018-03    378749.403341
2018-06    378862.052506
2018-09    378816.229117
Name: National_Mean_price, dtype: float64

# Transform both dataframes
* This is where it gets tricky. Both dataframes have the correct timepoints, but you need to transform this one a little differently:
    * Assume a 20% down payment. So first, multiply that month's sale price by 80% to get the loan amount. 
    * Next, grab the interest rate for that month and divide by 12. This'll give you the monthly interest rate for that month. This makes sense, because we're assuming houses bought for that specific month will have a 30-year, fixed interest rate. 
    * Divide that monthly interest rate by (1 - (1 + monthly_IR ** -360)). Then, multiply the loan amount with this quotient. Do that for the whole table, and you have your transformed dataset

# Plot Austin transformed median household income v. monthly mortgage payments

# Plot national transformed median household income v. monthly mortgage payments